Map<String, List> Jan = {},
    Feb = {},
    Mar = {},
    Apr = {},
    May = {},
    Jun = {},
    Jul = {},
    Aug = {},
    Sep = {},
    Oct = {},
    Nov = {},
    Dec = {},mySelectedEvents = {};
loadPreviousEvents() {
  Jan = {
    "2023-01-01": [
      {
        // "ପର୍ବପର୍ବାଣୀ": [
        //   "ଇଁରାଜୀ ନୂଆବର୍ଷ ୨୦୨୩",
        //   "ଶାମ୍ବ ଦଶମୀ",
        //   "ସୂର୍ଯ୍ୟେଦେବଙ୍କ ପୁଜା"
        // ],
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ତାରିଖ": "୧",
        "img":["duarabadha.jpeg"],
        "holydy":DateTime(2023, 01, 01),
      },
    ],
    "2023-01-02": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ପୁତ୍ରଦା ଏକାଦଶୀ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୨",
        "holyimg":["ekadasi.jpg"]
      }
    ],
    // "2023-01-03": [
    //   {"ତାରିଖ": "୩"}
    // ],
    "2023-01-04": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ତାରିଖ": "୪"
      }
    ],
    "2023-01-05": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦଶି ଉପବାସ", "ବେଢ଼ା"],
        "ତାରିଖ": "୫"
      }
    ],
    "2023-01-06": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ଦେବାଭିଶେକ ପୁର୍ଣିମା", "ଚନ୍ଦ୍ରପୂଜା"],
        "ତାରିଖ": "୬",
        "holyimg":["purnima.jpg"]
      }
    ],
    "2023-01-07": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ମାଘ ବ୍ରତାରମ୍ଵଃ"],
        "ତାରିଖ": "୭",
        // "img":[""]
      }
    ],
    "2023-01-08": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ପୁଷ୍ୟାଭିଷେକ", "ରାଜା ଭିଷେକ"],
        "ତାରିଖ": "୮",
        "holydy":DateTime(2023, 01, 08),
      }
    ],
    // "2023-01-09": [
    //   {"ତାରିଖ": "୯"}
    // ],
    "2023-01-10": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ସଙ୍କଟ ଚତୁର୍ଥୀ ବ୍ରତ"],
        "ତାରିଖ": "୧୦"
      }
    ],
    // "2023-01-11": [
    //   {"ତାରିଖ": "୧୧"}
    // ],
    "2023-01-12": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ସ୍ଵାମୀ ବିବେକାନନ୍ଦଙ୍କ ଜୟନ୍ତୀ"],
        "ତାରିଖ": "୧୨",
        "img":["bibekananda.jpeg"]
      }
    ],
    "2023-01-13": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ନବାଙ୍କ ବେଢା", "ମାସନ୍ତ"],
        "ତାରିଖ": "୧୩"
      }
    ],
    "2023-01-14": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ଉତ୍ତରାୟଣ ମକର ସଂକ୍ରାନ୍ତି", "ଫୋଙ୍ଗଲ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୪",
        "img":["makar-sankranti.jpeg"]

      }
    ],
    "2023-01-15": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ଅଷ୍ଟକାଶ୍ରାଧ"],
        "ସୁଭଦିନ": ["ବିବାହ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        "ତାରିଖ": "୧୫",
        "holydy":DateTime(2023, 01, 15),
      }
    ],
    "2023-01-16": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ତାରିଖ": "୧୬"
      }
    ],
    "2023-01-17": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        "ତାରିଖ": "୧୭"
      }
    ],
    "2023-01-18": [
      {
        "ପର୍ବପର୍ବାଣୀ": ["ଏକାଦଶୀ", "ହଳନିଶେଧ"],
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ"
        ],
        "ତାରିଖ": "୧୮",
        "holyimg":["ekadasi.jpg"],
        "holyimg":["ekadasi.jpg"]
      }
    ],
    "2023-01-19": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ"
        ],
        "ତାରିଖ": "୧୯"
      }
    ],
    "2023-01-20": [
      {
        "ପର୍ବପର୍ବାଣୀ": [
          "ରଟନ୍ତି ଚତୁର୍ଦ୍ଦଶୀ",
          "ରଟନ୍ତି କାଳିକା ପୂଜା",
          "ସିବଚତୁର୍ଦଶୀ ଉପବାସ"
        ],
        "ତାରିଖ": "୨୦"
      }
    ],
    "2023-01-21": [
      {
        "ପର୍ବପର୍ବାଣୀ": [
          "ତ୍ରିବେଣୀ ଅମାବାସ୍ୟା",
          "ମା ବିରଜା ଦେବୀଙ୍କ ଜନ୍ମୋତ୍ସବ",
          "ନଷ୍ଟ ଚନ୍ଦ୍ରୋପବାସ",
          "ଶରଣ ଆରମ୍ଭ",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୨୧",
        "img":["birajadevi.jpeg"],
        "holyimg":["amabashya-.jpg"]

      }
    ],
    "2023-01-22": [
      {
        //"ତାରିଖ": "୨୨",
        "holydy":DateTime(2023, 01, 23),
      }
    ],
    "2023-01-23": [
      {
        "ପର୍ବପର୍ବାଣୀ": [
          "ନେତାଜୀ ସୁବାସ ଚନ୍ଦ୍ର ବୋଷଙ୍କ ଜନ୍ମୋତ୍ସବ",
          "ଦ୍ଵିତୀୟା ର ଚନ୍ଦ୍ରଦର୍ଶନ ଓ ପୂଜା"
        ],
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଅନ୍ନ ପ୍ରାସନ"],
        "ତାରିଖ": "୨୩",
        "holydy":DateTime(2023, 01, 23),
        "img":["subas-chandra-bosh.jpeg"]
      }
    ],
    "2023-01-24": [
      {
        "ସୁଭଦିନ": ["ଚୁଡ଼ାକରଣ"],
        "ତାରିଖ": "୨୪"
      }
    ],
    "2023-01-25": [
      {
        "ପର୍ବପର୍ବାଣୀ": [
          "ବରଦା ଚତୁର୍ଥୀ",
          "ଶ୍ରୀ ଶ୍ରୀ ଜଗନ୍ନାଥ ମହାପ୍ରଭୁଙ୍କର ପଦ୍ମମୁଖ ବେଶ",
          "ଶରଣ ସେଷ"
        ],
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ରତୋପନୟନ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ତାରିଖ": "୨୫"
      }
    ],
    "2023-01-26": [
      {
        "ପର୍ବପର୍ବାଣୀ": [
          "ସାଧାରଣତନ୍ତ୍ର ଦିବସ",
          "ଶ୍ରୀପଞ୍ଚମୀ",
          "ସରସ୍ଵତୀ ପୂଜା",
          "ବସନ୍ତଉତ୍ସବ",
          "ଶ୍ରୀ ଶ୍ରୀ ମହାପ୍ରଭୁଙ୍କର ରଥ କାଠ ଅନୁକୂଳ"
        ],
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ତାରିଖ": "୨୬",
        "holydy":DateTime(2023, 01, 26),
        "img":["swadhinatadivas.jpeg"]
      }
    ],
    "2023-01-27": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ତାରିଖ": "୨୭"
      }
    ],
    "2023-01-28": [
      {
        "ପର୍ବପର୍ବାଣୀ": [
          "ମାଘ ସପ୍ତମୀ",
          "ଚନ୍ଦ୍ରଭାସା ତୀର୍ଥେ ସ୍ଥାନ",
          "ଭାଷ୍ଟାଷ୍ଟମି"
        ],
        "ତାରିଖ": "୨୮",
        "img":["magha-saptami.jpeg"]
      }
    ],
    "2023-01-29": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଚୁଡ଼ାକରଣ"],
        "ତାରିଖ": "୨୯",
        "holydy":DateTime(2023, 01, 29),
      }
    ],
    "2023-01-30": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ", "ଅନ୍ନ ପ୍ରାସନ"],
        "ତାରିଖ": "୩୦"
      }
    ],
    "2023-01-31": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ରତୋପନୟନ"],
        "ତାରିଖ": "୩୧"
      }
    ]
  };
  Feb = {
    "2023-02-01": [
      {
        "ପର୍ବପର୍ବାଣୀ": [
          "ଭୈମୀ ଏକାଦଶୀ ( ବଡ଼ )",
          "ବ୍ୟାସ ସରୋବର ମେଳା",
          "କରାହ ଦ୍ବାଦଶୀ"
        ],
        "ତାରିଖ": "୧",
        //"Mirrage": ["1"],
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-02-02": [
      {
        "ସୁଭଦିନ": [
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨"
      },
    ],
    "2023-02-03": [
      {
        "ସୁଭଦିନ": [
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆ୩ରମ୍ଭ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ନିତ୍ୟାନନ୍ଦ ମହାପ୍ରଭୁଙ୍କ ଜନ୍ମୋତ୍ସବ"],
        "ତାରିଖ": "୩"
      },
    ],
    "2023-02-04": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ ଉପବାସ", "ବେଢ଼ା ପରିକ୍ରମା "],
        "ତାରିଖ": "୪"
      },
    ],
    "2023-02-05": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ମାଘ ପୂର୍ଣ୍୫ଣିମା",
          "ମାଘ ବ୍ରତ ସମାପନ",
          "ଗଜ ଉଦ୍ଧାରଣ  ବେଶ",
          "ଅଗ୍ନ୍ୟାତ୍ସବ",
          "ଚନ୍ଦ୍ରପୂଜା ଓ ଯୋରନ୍ଦା ମେଳା"
        ],
        "ତାରିଖ": "୫",
        "holydy":DateTime(2023, 02, 05),
        "holyimg":["purnima.jpg"]
      },
    ],
    "2023-02-06": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୬"
      },
    ],
    "2023-02-07": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଚୁଡ଼ାକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୭"
      },
    ],
    "2023-02-08": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ", "ବିଦ୍ୟାରମ୍ଭ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୮"
      },
    ],
    "2023-02-09": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୯"
      },
    ],
    "2023-02-10": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ତାରିଖ": "୧୦"
        // "ପର୍ବପର୍ବାଣୀ": ["lhfs"],
      }
    ],
    "2023-02-11": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୧",
      },
    ],
    "2023-02-12": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୨",
        "holydy":DateTime(2023, 02, 12),
      },
    ],
    "2023-02-13": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["କୁମ୍ଭ ସଂକ୍ରାନ୍ତି", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୩"
      },
    ],
    "2023-02-14": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୪"
      },
    ],
    "2023-02-15": [
      {
        //"ସୁଭଦିନ": [],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୫"
      },
    ],
    "2023-02-16": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ରତୋପନୟନ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        //"Mirrage": [""],
        "ପର୍ବପର୍ବାଣୀ": ["ପଙ୍କୋଦ୍ଧାର ଏକାଦଶୀ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୬",
        "holyimg":["ekadasi.jpg"]
      }
    ],
    "2023-02-17": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୧୭"
      },
    ],
    "2023-02-18": [
      {
        // //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ମହାଶିବ ରାତ୍ରି ( ଜାଗର )"],
        "ତାରିଖ": "୧୮",
        "holydy":DateTime(2023, 02, 18),
        "img":["jagar.jpeg"]
      },
    ],
    "2023-02-19": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ସବେ - ମେରାଜ ( ପୂର୍ବରାତ୍ରି )",
          "ଚନ୍ଦ୍ରକ୍ଷୟ",
          "ନିଶିପାଳନ",
          "ନଷ୍ଟ ଚନ୍ଦ୍ରାପବାସ",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୧୯",
        "holydy":DateTime(2023, 02, 19),
      },
    ],
    "2023-02-20": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଅମାବାସ୍ଯା"],
        "ତାରିଖ": "୨୦",
        "holyimg":["amabashya-.jpg"]
      },
    ],
    "2023-02-21": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରଦର୍ଶନ", "ଶରଣ ଶେଶ"],
        "ତାରିଖ": "୨୧"
      },
    ],
    "2023-02-22": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ତାରିଖ": "୨୨"
        // "ପର୍ବପର୍ବାଣୀ": ["durga puja"]
      }
    ],
    "2023-02-23": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୩"
      },
    ],
    "2023-02-24": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୪"
      },
    ],
    "2023-02-25": [
      {
        //"ସୁଭଦିନ": [],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୫",
      },
    ],
    "2023-02-26": [
      {
        //"ସୁଭଦିନ": [],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୬",
        "holydy":DateTime(2023, 02, 26),
      },
    ],
    // "2023-02-27": [
    //   {
    //     "ସୁଭଦିନ": ["ବିବାହ"],
    //     // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
    //     "ତାରିଖ": "୨୭"
    //   },
    // ],
    "2023-02-28": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଚୁଡ଼ାକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୮"
      },
    ],
    // "2023-02-29": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
    //     "ତାରିଖ": "୨୯"
    //   },
    // ],
    // "2023-02-30": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
    //     "ତାରିଖ": "୩୦"
    //   },
    // ],
    // "2023-02-31": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
    //     "ତାରିଖ": "୩୧"
    //   },
    // ],
  };
  Mar = {
    "2023-03-01": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଫଗୁ ଦଶମୀ"],
        "ତାରିଖ": "୧",
      },
    ],
    "2023-03-02": [
      {
        "ସୁଭଦିନ": [
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ୨ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨"
      },
    ],
    "2023-03-03": [
      {
        "ସୁଭଦିନ": [
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ୩ ପ୍ରବେଶ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ସର୍ବସମ୍ମତ ପାପନାଶିନୀ ( ଆମର୍ଦ୍ଦକୀ ) ଏକାଦଶୀ"],
        "ତାରିଖ": "୩",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-03-04": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ସାମାନ୍ୟ ଗୋବିନ୍ଦ ଦ୍ଵାଦଶୀ ସ୍ନାନ"],
        "ତାରିଖ": "୪"
      },
    ],
    "2023-03-05": [
      {
        "ସୁଭଦିନ": ["ବ୍ରତୋପନୟନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ ଉପବାସ", "ବେଢ଼ା ପରିକ୍ରମା"],
        "ତାରିଖ": "୫",
        "holydy":DateTime(2023, 03, 05),
      },
    ],
    "2023-03-06": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        "ପର୍ବପର୍ବାଣୀ": ["ବରାହ ଦୋଳ", "ରାଜୀଗ୍ନି", "ଓଳକଣା ମେଲଣ", "ଚନ୍ଦ୍ର ପୂଜା"],
        "ତାରିଖ": "୬"
      },
    ],
    "2023-03-07": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଦୋଳ ପୂର୍ଣିମା୫ ୬ ",
          "ଶ୍ରୀ ଚୈତନ୍ୟ ଦେବଙ୍କର ଜନ୍ମୋତ୍ସବ" "ଶ୍ରୀ ଜୀଉଙ୍କର ରାଜବେଶ"
        ],
        "ତାରିଖ": "୭",
        "holydy":DateTime(2023, 03, 07),
        "img":["dola-purnima.jpeg"],
        "holyimg":["purnima.jpg"]
      },
    ],
    "2023-03-08": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        "ପର୍ବପର୍ବାଣୀ": ["ହୋଲି ଉତ୍ସବ", "ସର୍ବ - ବରାତ୍ ( ପୂର୍ବରାତ୍ରି )"],
        "ତାରିଖ": "୮",
        "holydy":DateTime(2023, 03, 08),
        "img":["holi.jpeg"]
      },
    ],
    "2023-03-09": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ରତୋପନୟନ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୯"
      },
    ],
    "2023-03-10": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ତାରିଖ": "୧୦"
        //  "ପର୍ବପର୍ବାଣୀ": ["lhfs"],
      }
    ],
    "2023-03-11": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        "ପର୍ବପର୍ବାଣୀ": ["ପଞ୍ଚୁଦୋଳ", "୧୩- ସ୍କନ୍ଧ ଷଷ୍ଠୀ"],
        "ତାରିଖ": "୧୧",
        "img":["dola-purnima.jpeg"]
      },
    ],
    "2023-03-12": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୨",
        "holydy":DateTime(2023, 03, 12),
      },
    ],
    "2023-03-13": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ରତୋପନୟନ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୩"
      },
    ],
    "2023-03-14": [
      {
        "ସୁଭଦିନ": ["ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ତାରାତାରେଣୀ ଯାତ୍ରା", "ମାସାନ୍ତ"],
        "ତାରିଖ": "୧୪"
      },
    ],
    "2023-03-15": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ମୀନ ସଂକ୍ରାନ୍ତି", "ହ.ନି.", "୧୬– ଦଶ ଦୋଳ"],
        "ତାରିଖ": "୧୫"
      },
    ],
    // "2023-03-16": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ତାରିଖ": "୧୬"
    //     //"ପର୍ବପର୍ବାଣୀ": ["yes"]
    //   }
    // ],
    "2023-03-17": [
      {
        "ସୁଭଦିନ": ["ବ୍ରତୋପନୟନ", "ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ", "ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୧୭"
      },
    ],
    "2023-03-18": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ପାପମୋଚନୀ ଏକାଦଶୀ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୮",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-03-19": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ବାରଣୀ ସ୍ନାନ"],
        "ତାରିଖ": "୧୯",
        "holydy":DateTime(2023, 03, 19),
      },
    ],
    "2023-03-20": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ସ୍ନେହୀ ଚତୁର୍ଦ୍ଦଶୀ", "ଶିବତୁର୍ଦ୍ଦଶୀ ଉପବାସ", "ବେଢ଼ା"],
        "ତାରିଖ": "୨୦"
      },
    ],
    "2023-03-21": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ମଧୁ ଅମାବାସ୍ୟା",
          "ଚନ୍ଦ୍ରକ୍ଷୟ",
          "ନିଶିପାଳନ",
          "ନଷ୍ଟ ଚନ୍ଦ୍ରୋପବାସ",
          "ଶରଣ ଶେଷ",
          "ହ.ନି"
        ],
        "ତାରିଖ": "୨୧",
        "holyimg":["amabashya-.jpg"]
      },
    ],
    "2023-03-22": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ସୃଷ୍ୟାରମ୍ଭ ଦିବସ",
          "ତେଲୁଗୁ ନୂତନ ବର୍ଷ",
          "ସମ୍ବତ ୨୦୮୦ ପ୍ରବେଶ",
          "ବାସନ୍ତୀକ ଶ୍ରୀ ଦୁର୍ଗାଦେବ୍ୟା ନବଦିନାତ୍ମକ ପୂଜାରମ୍ଭ"
        ],
        "ତାରିଖ": "୨୨"
      }
    ],
    "2023-03-23": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଦ୍ଵିତୀୟାର ଚନ୍ଦ୍ରଦର୍ଶନ", "ରାଷ୍ଟ୍ରୀୟ ନବବର୍ଷ ଆରମ୍ଭ"],
        "ତାରିଖ": "୨୩"
      },
    ],
    "2023-03-24": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ", "ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ରମଜାନ ମାସ ଆରମ୍ଭ"],
        "ତାରିଖ": "୨୪",
        "img":["ramjan.jpeg"]
      },
    ],
    "2023-03-25": [
      {
        //"ସୁଭଦିନ": [],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୫",
      },
    ],
    "2023-03-26": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ବାସନ୍ତୀକ ଶ୍ରୀଦୁର୍ଗ ଦେବ୍ୟାଛ ବିଲ୍ଵବରଣ"],
        "ତାରିଖ": "୨୬",
        "holydy":DateTime(2023, 03, 26),
      },
    ],
    "2023-03-27": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ବାସନ୍ତୀକ୨୭ ଶ୍ରୀଦୁର୍ଗାଦେବ୍ୟା ସପ୍ତମୀ ପୂଜା",
          "ଶ୍ରୀମନ୍ଦିରେ ଚୈତ୍ର ଗୁଣ୍ଡିଚା ଯାତ୍ରା"
        ],
        "ତାରିଖ": "୨୭"
      },
    ],
    "2023-03-28": [
      {
        "ସୁଭଦିନ": ["ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଶ୍ରୀ ଶ୍ରୀ ଲିଙ୍ଗରାଜ ଦେବଙ୍କ ରଥ ପ୍ରତିଷ୍ଠା",
          "ବାସନ୍ତୀକ ଶ୍ରୀଦୁର୍ଗାଦେବ୍ୟା ମହାଷ୍ଟମୀ ପୂଜା"
        ],
        "ତାରିଖ": "୨୮"
      },
    ],
    "2023-03-29": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଅଶୋକାଷ୍ଟମୀ",
          "ଶ୍ରୀ ଶ୍ରୀ ଲିଙ୍ଗରାଜ ଦେବନ ରଥଯାତ୍ରା",
          "ବାସନ୍ତୀକ ଶ୍ରୀଦୁର୍ଗଦେବ୍ୟା ମହାନବମୀ ପୂଜା",
          "ଶ୍ରୀମନ୍ଦିରେ କେଉଟ ଭୋଗ"
        ],
        "ତାରିଖ": "୨୯"
      },
    ],
    "2023-03-30": [
      {
        "ସୁଭଦିନ": ["ବ୍ରତୋପନୟନ", "ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରୀରାମ ନବମୀ", "ଶ୍ରୀଦୁର୍ଗାଦେବ୍ୟା ବିଶ୍ରାମ"],
        "ତାରିଖ": "୩୦",
        "holydy":DateTime(2023, 03, 30),
        "img":["ram-nabami.jpeg"]
      },
    ],
    "2023-03-31": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ବାସନ୍ତୀକ ବାସନ୍ତୀକ ଦଶହରା" "ଶ୍ରୀମନ୍ଦିରେ ଯଜ୍ଞ ରକ୍ଷା"],
        "ତାରିଖ": "୩୧"
      },
    ],
  };
  Apr = {
    "2023-04-01": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଉତ୍କଳ ଦିବସ", "କାମଦା ଏକାଦଶୀ", "ସୀତା ବିବାହ", "ହ.ନି"],
        "ତାରିଖ": "୧",
        "holydy":DateTime(2023, 04, 01),
        //"img":[""],
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-04-02": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ", "ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ରାମାନୁଜ ବୈଷ୍ଣବ ଏକାଦଶୀ"],
        "ତାରିଖ": "୨",
        "holydy":DateTime(2023, 04, 02),
      },
    ],
    "2023-04-03": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଅନଙ୍ଗ ତ୍ରୟୋଦଶୀ"],
        "ତାରିଖ": "୩"
      },
    ],
    "2023-04-04": [
      {
        "ସୁଭଦିନ": ["ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଶିବ ଦମ୪ନକ ଚତୁର୍ଦ୍ଦଶୀ",
          "ଶିବଚତୁର୍ଦ୍ଦଶୀ ଉପବାସ",
          "ବେଢ଼ା"
        ],
        "ତାରିଖ": "୪"
      },
    ],
    "2023-04-05": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ବିଷ୍ଣୁ ଦମ୫ନକ ଚତୁର୍ଦ୍ଦଶୀ",
          "ହିଙ୍ଗୁଳା ଯାତ୍ରା ଓ ଚନ୍ଦ୍ରପୂଜା"
        ],
        "ତାରିଖ": "୫"
      },
    ],
    "2023-04-06": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଚୈତ୍ର ପୂର୍ଣ୍ଣିମା", "ବୈଶାଖ ବ୍ରତାରମଃ"],
        "ତାରିଖ": "୬",
        "img":["chaitra-purnima.jpeg"],
        "holyimg":["purnima.jpg"]
      },
    ],
    "2023-04-07": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଗୁଳ୍ମ ଫ୍ରାଇଡ଼େ"],
        "ତାରିଖ": "୭",
        "holydy":DateTime(2023, 04, 07)
      },
    ],
    "2023-04-08": [
      {
        //"ସୁଭଦିନ": [],
        //"ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୮",
      }
    ],
    "2023-04-09": [
      {
        "ସୁଭଦିନ": ["ବ୍ରତୋପନୟନ", "ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୯",
        "holydy":DateTime(2023, 04, 09)
      },
    ],
    "2023-04-10": [
      {
        "ସୁଭଦିନ": ["ବ୍ରତୋପନୟନ", "ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ତାରିଖ": "୧୦"
        // "ପର୍ବପର୍ବାଣୀ": ["lhfs"],
      }
    ],
    // "2023-04-11": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
    //     "ତାରିଖ": "୧୧"
    //   },
    // ],
    // "2023-04-12": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
    //     "ତାରିଖ": "୧୨"
    //   },
    // ],
    "2023-04-13": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୧୩"
      },
    ],
    "2023-04-14": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ମହାବିଷୁବ ପଣା ସଂକ୍ରାନ୍ତି",
          "ରାଧାରମଣ ଦେବ . ହନୁମାନଙ୍କ ଜୟନ୍ତୀ",
          "ହ.ନି."
        ],
        "ତାରିଖ": "୧୪",
        "holydy":DateTime(2023, 04, 14),
        "img":["pana-sankranti.jpeg"]
      },
    ],
    "2023-04-15": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୫"
      },
    ],
    "2023-04-16": [
      {
        "ସୁଭଦିନ": ["ବରୁଥିନୀ ଏକାଦଶୀ", "ହ.ନି."],
        "ତାରିଖ": "୧୬",
        "ପର୍ବପର୍ବାଣୀ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ନାମକରଣ", "ଚୁଡ଼ାକରଣ"],
        "holydy":DateTime(2023, 04, 16),
        "holyimg":["ekadasi.jpg"]
      }
    ],
    "2023-04-17": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଶେଷ"],
        "ତାରିଖ": "୧୭"
      },
    ],
    "2023-04-18": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ", "ବେଢ଼ା ପରିକ୍ରମା"],
        "ତାରିଖ": "୧୮"
      },
    ],
    "2023-04-19": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଚନ୍ଦ୍ରକ୍ଷୟ",
          "ନିଶିପାଳନ",
          "ସବେ - ଜଦର ( ପୂର୍ବରାତ୍ରି )",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୧୯"
      },
    ],
    "2023-04-20": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ରକ୍ମିଣୀ ଅମାବାସ୍ୟା"],
        "ତାରିଖ": "୨୦",
        "holyimg":["amabashya-.jpg"]
      },
    ],
    "2023-04-21": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରଦର୍ଶନ ଓ ପୂଜା"],
        "ତାରିଖ": "୨୧"
      },
    ],
    "2023-04-22": [
      {
        //"ସୁଭଦିନ": [],
        //"Mirrage": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଇଦୁଇଫିତର୍", "ରମଜାନ ମାସ ଶେଷ"],
        "ତାରିଖ": "୨୨",
        "holydy":DateTime(2023, 02, 22),
        "img":["idul-fitar-2.jpeg"]
      }
    ],
    "2023-04-23": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଅକ୍ଷୟ ତୃତୀୟା"],
        "ତାରିଖ": "୨୩",
        "img":["akshya-trutiya.jpeg"],
        "holydy":DateTime(2023, 04, 23)
      },
    ],
    "2023-04-24": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        //"ପର୍ବପର୍ବାଣୀ": [""Hala Nisedha""],
        "ତାରିଖ": "୨୪"
      },
    ],
    "2023-04-25": [
      {
        "ସୁଭଦିନ": ["ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଜଗଦ୍‌ଗୁରୁ ଶଙ୍କରଚାର୍ଯ୍ୟଙ୍କ ଜୟନ୍ତୀ"],
        "ତାରିଖ": "୨୫"
      },
    ],
    "2023-04-26": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ନାମକରଣ", "ଚୁଡ଼ାକରଣ", "ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ରାମାନୁଜାଚାର୍ଯ୍ୟଙ୍କ ଜୟନ୍ତୀ"],
        "ତାରିଖ": "୨୬"
      },
    ],
    "2023-04-27": [
      {
        "ସୁଭଦିନ": [
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ୨୭",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        // "ପର୍ବପର୍ବାଣୀ": [""Hala Nisedha""],
        "ତାରିଖ": "୨୭"
      },
    ],
    "2023-04-28": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ବ୍ୟବସାୟ ଆରମ୍ଭ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ନୀଳାଦ୍ରୀ ମହୋଦୟାଷ୍ଟମୀ", "ମଧୁସୂଦନଙ୍କ ଜୟନ୍ତୀ"],
        "ତାରିଖ": "୨୮"
      },
    ],
    "2023-04-29": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        "ପର୍ବପର୍ବାଣୀ": ["ସୀତା ନବମୀ", "ଶନିଶ୍ଚର ଯଜ୍ଞ"],
        "ତାରିଖ": "୨୯"
      },
    ],
    "2023-04-30": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଚୁଡ଼ାକରଣ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୩୦",
        "holydy":DateTime(2023, 04, 30)
      },
    ],
    // "2023-04-31": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
    //     "ତାରିଖ": "୩୧"
    //   },
    // ],
  };
  May = {
    "2023-05-01": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରମିକ ଦିବସ", "ମୋହିନୀ ଏକାଦଶୀ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧",
        "img":["labor.jpeg"],
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-05-02": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨"
      },
    ],
    "2023-05-03": [
      {
        "ସୁଭଦିନ": [
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆ୩ରମ୍ଭ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
        ],
        //"ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୩"
      },
    ],
    "2023-05-04": [
      {
        "ସୁଭଦିନ": ["ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ନୃସିଂହ ଜନ୍ମ", "ଶିବ ଚତୁର୍ଦ୍ଦଶୀ", "ବେଢ଼ା ପରିକ୍ରମା"],
        "ତାରିଖ": "୪",
        "img":["jagar.jpeg"]
      },
    ],
    "2023-05-05": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଚନ୍ଦନ ପୂ୫ର୍ଣ୍ଣିମା",
          "ଚନ୍ଦ୍ରପୂଜା",
          "ବୈଶାଖ ବ୍ରତ ସମାପନ",
          "ବୁଦ୍ଧ ଜୟନ୍ତୀ"
        ],
        "ତାରିଖ": "୫",
        "holydy":DateTime(2023, 05, 05),
        "img":["chandan-yatra.jpeg"],
        "holyimg":["purnima.jpg"]
      },
    ],
    "2023-05-06": [
      {
        //"ସୁଭଦିନ": [],
        //"ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୬"
      },
    ],
    "2023-05-07": [
      {
        "ସୁଭଦିନ": ["ବ୍ରତୋପନୟନ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ନାମକରଣ", "ବିଦ୍ୟାରମ୍ଭ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୭",
        "holydy":DateTime(2023, 05, 07)
      },
    ],
    "2023-05-08": [
      {
        "ସୁଭଦିନ": ["ଚୁଡ଼ାକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୮"
      },
    ],
    "2023-05-09": [
      {
        //"ସୁଭଦିନ": [],
        //"ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୯"
      },
    ],
    "2023-05-10": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୧୦"
      }
    ],
    "2023-05-11": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୧"
      },
    ],
    "2023-05-12": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରୀକ୍ଷେତ୍ରେ ଭଉଁରୀ"],
        "ତାରିଖ": "୧୨"
      },
    ],
    "2023-05-13": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଉତ୍କଳେ ଭଉଁରୀ"],
        "ତାରିଖ": "୧୩",
      },
    ],
    "2023-05-14": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଶେଷ", "ମାସାନ୍ତ"],
        "ତାରିଖ": "୧୪",
        "holydy":DateTime(2023, 05, 14)

      },
    ],
    "2023-05-15": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ବୃଷ ସଂକ୍ରାନ୍ତି",
          "ଜଳକ୍ରୀଡ଼ା ଏକାଦଶୀ ଉପବାସ",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୧୫",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-05-16": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ରତୋପନୟନ", "ନାମକରଣ"],
        "ତାରିଖ": "୧୬",
        //"ପର୍ବପର୍ବାଣୀ": ["yes"]
      }
    ],
    "2023-05-17": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ"
        ],
        //"ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୭"
      },
    ],
    "2023-05-18": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ ଉପବାସ", "ବେଢ଼ା"],
        "ତାରିଖ": "୧୮"
      },
    ],
    "2023-05-19": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ସାବିତ୍ରୀ ବ୍ରତ",
          "ଅମାବାସ୍ୟା",
          "ଚନ୍ଦ୍ରକ୍ଷୟ",
          "ନିଶିପାଳନ ଜ୍ୟେଷ୍ଠା",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୧୯",
        "holydy":DateTime(2023, 05, 19),
        "img":["sabitri.jpeg"],
        "holyimg":["amabashya-.jpg"]
      },
    ],
    "2023-05-20": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ନାମକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୦"
      },
    ],
    "2023-05-21": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରଦର୍ଶନ", "ପୂଜା"],
        "ତାରିଖ": "୨୧",
        "holydy":DateTime(2023, 05, 21)
      },
    ],
    "2023-05-22": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ତାରିଖ": "୨୨",
        "ପର୍ବପର୍ବାଣୀ": ["durga puja"]
      }
    ],
    "2023-05-23": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଉମା ଚତୁର୍ଥୀ"],
        "ତାରିଖ": "୨୩"
      },
    ],
    "2023-05-24": [
      {
        "ସୁଭଦିନ": [
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବ ବିବାହୋତ୍ସବ"],
        "ତାରିଖ": "୨୪"
      },
    ],
    "2023-05-25": [
      {
        "ସୁଭଦିନ": [
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଶୀତଳ ଷଷ୍ଠୀ", "ଆରଣ୍ୟକ ଷଷ୍ଠୀ"],
        "ତାରିଖ": "୨୫"
      },
    ],
    "2023-05-26": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ବିଦ୍ୟାରମ୍ଭ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୬"
      },
    ],
    "2023-05-27": [
      {
        //"ସୁଭଦିନ": [],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୭",
      },
    ],
    "2023-05-28": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ବିଦ୍ୟାରମ୍ଭ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୮",
        "holydy":DateTime(2023, 05, 28)
      },
    ],
    "2023-05-29": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୯"
      },
    ],
    "2023-05-30": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ରତୋପନୟନ", "ନାମକରଣ", "ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଗଙ୍ଗା ଦଶହରା"],
        "ତାରିଖ": "୩୦"
      },
    ],
    "2023-05-31": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ନିର୍ଜଳା ଏକାଦଶୀ ଉପବାସ", "ରକ୍ମଣୀ ବିବାହ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୩୧",
        "holyimg":["ekadasi.jpg"]
      },
    ],
  };
  Jun = {
    "2023-06-01": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଚମ୍ପକ ଦ୍ୱାଦଶୀ"],
        "ତାରିଖ": "୧",
      },
    ],
    "2023-06-02": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ୨",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ ଉପବାସ", "ବେଢ଼ା"],
        "ତାରିଖ": "୨"
      },
    ],
    "2023-06-03": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ପୂଷ୍ଣିମାର ଚନ୍ଦ୍ରପୂଜା"],
        "ତାରିଖ": "୩"
      },
    ],
    "2023-06-04": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଦେବସ୍ନାନ ପୂର୍ଣିମା"],
        "ତାରିଖ": "୪",
        "holydy":DateTime(2023, 06, 04),
        "holyimg":["purnima.jpg"]
      },
    ],
    "2023-06-05": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୫"
      },
    ],
    "2023-06-06": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଚୁଡ଼ାକରଣ"],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୬"
      },
    ],
    "2023-06-07": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୭"
      },
    ],
    "2023-06-08": [
      {
        "ସୁଭଦିନ": ["ବ୍ରତୋପନୟନ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୮"
      },
    ],
    "2023-06-09": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ରତୋପନୟନ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ନାମକରଣ"],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୯"
      },
    ],
    "2023-06-10": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ତାରିଖ": "୧୦",
        //  "ପର୍ବପର୍ବାଣୀ": ["lhfs"],
      }
    ],
    "2023-06-11": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଶେଷ"],
        "ତାରିଖ": "୧୧",
        "holydy":DateTime(2023, 06, 11)
      },
    ],
    "2023-06-12": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ"
        ],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୨"
      },
    ],
    "2023-06-13": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ବ୍ରତୋପନୟନ", "ନାମକରଣ", "ଚୁଡ଼ାକରଣ"],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୧୩"
      },
    ],
    "2023-06-14": [
      {
        "ସୁଭଦିନ": ["ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ପହିଲି ରଜ",
          "ଖଳିଲାଗି ଏକାଦଶୀ",
          "ପଠାଣି ସାମନ୍ତଙ୍କ ତିରୋଧାନ ଦିବସ",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୧୪",
        "holydy":DateTime(2023, 06, 14),
        //"img":["raja-parba.jpeg"],
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-06-15": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ମିଥୁନ ( ରଜ ) ସଂକ୍ରାନ୍ତି", "ହ.ନି."],
        "ତାରିଖ": "୧୫",
        "holydy":DateTime(2023, 06, 15),
        //"img":["raja-parba.jpeg"]
      },
    ],
    "2023-06-16": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଭୂଦାହ",
          "ଶେଷ ରଜ",
          "ଅଣସର ତ୍ରୟୋଦଶୀ",
          "ଶିବଚତୁର୍ଦ୍ଦଶୀ ଉପବାସ",
          "ବେଢ଼ା ପରିକ୍ରମା"
        ],
        "ତାରିଖ": "୧୬",
        "img":["raja-parba.jpeg"]
      }
    ],
    "2023-06-17": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରକ୍ଷୟ", "ନିଶିପାଳନ", "ହ.ନି"],
        "ତାରିଖ": "୧୭"
      },
    ],
    "2023-06-18": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଅମାବାସ୍ୟା", "ନେତ୍ରୋତ୍ସବ"],
        "ତାରିଖ": "୧୮",
        "holydy":DateTime(2023, 06, 18),
        "holyimg":["amabashya-.jpg"]
      },
    ],
    "2023-06-19": [
      {
        "ସୁଭଦିନ": [
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଉଭାଯାତ୍ରା", "ନବଯୌବନ ଦର୍ଶନ", "ଚନ୍ଦ୍ରଦର୍ଶନ"],
        "ତାରିଖ": "୧୯"
      },
    ],
    "2023-06-20": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରୀଗୁଣ୍ଡିଚା ( ରଥଯାତ୍ରା )"],
        "ତାରିଖ": "୨୦",
        "holydy":DateTime(2023, 06, 20),
        "img":["rathayatra.jpeg"]
      },
    ],
    "2023-06-21": [
      {
        "ସୁଭଦିନ": [
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ",
          "ଚୁଡ଼ାକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ"
        ],
        // "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୧"
      },
    ],
    "2023-06-22": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଅନ୍ନ ପ୍ରାସନ"],

        // "ପର୍ବପର୍ବାଣୀ": [,"durga puja"]
        "ତାରିଖ": "୨୨"
      }
    ],
    "2023-06-23": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଚୁଡ଼ାକରଣ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୩"
      },
    ],
    "2023-06-24": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ହେରା ପଞ୍ଚମୀ"],
        "ତାରିଖ": "୨୪",
      },
    ],
    "2023-06-25": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
        ],
        //  "ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୨୫",
        "holydy":DateTime(2023, 06, 25)
      },
    ],
    "2023-06-26": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ପର୍ଶୁରାମାଷ୍ଟମୀ"],
        "ତାରିଖ": "୨୬"
      },
    ],
    "2023-06-27": [
      {
        "ସୁଭଦିନ": ["ଚୁଡ଼ାକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ବିପତ୍ତାରିଣୀ ବ୍ରତ,ନବମୀର ସନ୍ଧ୍ୟା ଦର୍ଶନ"],
        "ତାରିଖ": "୨୭",
      },
    ],
    "2023-06-28": [
      {
        "ସୁଭଦିନ": [
          "ବ୍ରତୋପନୟନ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ବାହୁଡ଼ା ଯାତ୍ରା"],
        "ତାରିଖ": "୨୮"
      },
    ],
    "2023-06-29": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଇଦୁଜ୍ଜୁହା",
          "ସୁନା ବେଶ",
          "ହରିଶୟନ ଏକାଦଶୀ",
          "ଲକ୍ଷ୍ମୀ ନାରାୟଣ ବ୍ରତ",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୨୯",
        "img":["sunabesa.jpeg"],
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-06-30": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଗରୁଡ଼ ଶୟନ"],
        "ତାରିଖ": "୩୦",
        "holydy":DateTime(2023, 06, 30)
      },
    ],
    "2023-06-31": [
      {
        //"ସୁଭଦିନ": [],
        //"ପର୍ବପର୍ବାଣୀ": ["Hala Nisedha"],
        "ତାରିଖ": "୩୧"
      },
    ],
  };
  Jul = {
    "2023-07-01": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରୀ ଜୀଉଙ୍କର ନିଳାଦ୍ରୀ ବିଜେ ଉତ୍ସବ"],
        "ତାରିଖ": "୧"
      },
    ],
    "2023-07-02": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବ ଶୟନ ଉପବାସ"],
        "ତାରିଖ": "୨",
        "holydy":DateTime(2023, 07, 02)
      },
    ],
    "2023-07-03": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ବ୍ୟାସ", "ଗୁରୁ ପୂର୍ଣ୍ଣିମା", "ଚନ୍ଦ୍ରପୂଜା "],
        "ତାରିଖ": "୩",
        "holyimg":["purnima.jpg"]
      },
    ],
    "2023-07-04": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୪"
      },
    ],
    "2023-07-05": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        //"ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୫"
      },
    ],
    // "2023-07-06": [
    //   {"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୬"},
    // ],
    "2023-07-07": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ମନସା ପଞ୍ଚମୀ"],
        "ତାରିଖ": "୭"
      },
    ],
    "2023-07-08": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଶେଷ"],
        "ତାରିଖ": "୮",
      },
    ],
    "2023-07-09": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୯",
        "holydy":DateTime(2023, 07, 09)
      },
    ],
    "2023-07-10": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ବୋଲବମ୍ ଆରମ୍ଭ"],
        "ତାରିଖ": "୧୦",
        "img":["bolbom.jpeg"]
      }
    ],
    // "2023-07-11": [
    //   {"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୧୧"},
    // ],
    // "2023-07-12": [
    //   {"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୧୨"},
    // ],
    "2023-07-13": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["କାମଦା ଏକାଦଶୀ ଉପବାସ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୩",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-07-14": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୧୪"
      },
    ],
    "2023-07-15": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୧୫"
      },
    ],
    "2023-07-16": [
      {
        //"ସୁଭଦିନ": [],
        "Mirrage": [],
        "ତାରିଖ": "୧୬",
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ", "ବେଢ଼ା ପରିକ୍ରମା"],
        "holydy":DateTime(2023, 07, 16)
      }
    ],
    "2023-07-17": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଦକ୍ଷିଣ।ୟନ କର୍କ ଟ ସଂକ୍ରାନ୍ତି",
          "ଚିଡା ଲାଗି ଅମାବାସ୍ୟା",
          "ଚନ୍ଦ୍ର କ୍ଷୟ",
          "ନିଶିପାଳନ",
          "ଶ୍ରୀମନ୍ଦିରରେ",
          "ଗୃହିଣଂ ଚିତାଲାଗି ପର୍ବ",
          "ହ.ନି."
        ],
        "ତାରିଖ": "୧୭",
        "holyimg":["amabashya-.jpg"]
      },
    ],
    // "2023-07-18": [
    //   {"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୧୮"},
    // ],
    "2023-07-19": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରଦର୍ଶନ", "ପୂଜା"],
        "ତାରିଖ": "୧୯"
      },
    ],
    // "2023-07-20": [
    //   {"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୨୦"},
    // ],
    // "2023-07-21": [
    //   {"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୨୧"},
    // ],
    "2023-07-22": [
      {
        //"ସୁଭଦିନ": [],
        "Mirrage": [],
        "ପର୍ବପର୍ବାଣୀ": ["durga puja"],
        "ତାରିଖ": "୨୨",
      }
    ],
    "2023-07-23": [
      {
        "holydy":DateTime(2023, 07, 02),
        //"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୨୩",
      },
    ],
    // "2023-07-24": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୨୪"},
    // ],
    // "2023-07-25": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୨୫"},
    // ],
    // "2023-07-26": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୨୬"},
    // ],
    // "2023-07-27": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୨୭"},
    // ],
    "2023-07-28": [
      {//"ସୁଭଦିନ": [],
        // "ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୨୮", "holydy":DateTime(2023, 07, 28)},
    ],
    "2023-07-29": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ମ ହ ର ମ", "ହରି ଶୟନ ଏକାଦଶୀ ଉପବାସ", "ହ.ନି."],
        "ତାରିଖ": "୨୯",
        "imgh":[],
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-07-30": [
      {
        //"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୩୦"

        "holydy":DateTime(2023, 07, 02)},
    ],
    "2023-07-31": [

      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ ଉପବାସ", "ବେଢ଼ା ପରିକ୍ରମା", "ଶରଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୩୧"
      },
    ],
  };
  Aug = {
    "2023-08-01": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରାବଣ ( ମଳ ) ପୂର୍ଣ୍ଣିମା", "ଚନ୍ଦ୍ରପୂଜା"],
        "ତାରିଖ": "୧",
        "holyimg":["purnima.jpg"]
      },
    ],
    // "2023-08-02": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୨"},
    // ],
    // "2023-08-03": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୩"},
    // ],
    "2023-08-04": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ପୁରୁଷୋତ୍ତମ ଏକାଦଶୀ ଉପବାସ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୪"
      },
    ],
    // "2023-08-05": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୫"},
    // ],
    "2023-08-06": [
      {"holydy":DateTime(2023, 08, 06)
        //"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୬"
      },
    ],
    // "2023-08-07": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୭"},
    // ],
    // "2023-08-08": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୮"},
    // ],
    // "2023-08-09": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୯"},
    // ],
    // "2023-08-10": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୧୦"}
    // ],
    // "2023-08-11": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୧୧"},
    // ],
    "2023-08-12": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ପୁରୁଷୋତ୍ତମ ଏକାଦଶୀ ଉପବାସ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୨",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-08-13": [
      {"holydy":DateTime(2023, 08, 13)
        //"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୧୩"
      },
    ],
    "2023-08-14": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ ଉପବାସ", "ବେଢ଼ା ପରିକ୍ରମା"],
        "ତାରିଖ": "୧୪"
      },
    ],
    "2023-08-15": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ସ୍ବାଧୀନତା ଦିବସ", "ଚନ୍ଦ୍ରକ୍ଷୟ", "ନିଶିପାଳନ"],
        "ତାରିଖ": "୧୫",
        "holydy":DateTime(2023, 08, 15),
        "img":["swadhinatadivas.jpeg"]
      },
    ],
    "2023-08-16": [
      {
        //"ସୁଭଦିନ": [],
        "Mirrage": [],
        "ତାରିଖ": "୧୬",
        "ପର୍ବପର୍ବାଣୀ": ["ଅମାବାସ୍ଯା"],
        "holyimg":["amabashya-.jpg"]
      }
    ],
    "2023-08-17": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ସିଂହ ସଂକ୍ରାନ୍ତି", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୭"
      },
    ],
    "2023-08-18": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରଦର୍ଶନ", "ପୂଜା"],
        "ତାରିଖ": "୧୮"
      },
    ],
    "2023-08-19": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୧୯"
      },
    ],
    "2023-08-20": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୨୦",
        "holydy":DateTime(2023, 08, 20)
      },
    ],
    "2023-08-21": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଜାଗ୍ରତଗୌରୀ ପଞ୍ଚମୀ"],
        "ତାରିଖ": "୨୧"
      },
    ],
    "2023-08-22": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["du,rga puja"],
        "ତାରିଖ": "୨୨"
      }
    ],
    "2023-08-23": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        //"ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୨୩"
      },
    ],
    "2023-08-24": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": [],
        "ତାରିଖ": "୨୪"
      },
    ],
    // "2023-08-25": [
    //   {//"ସୁଭଦିନ": [], //"ପର୍ବପର୍ବାଣୀ": [], "ତାରିଖ": "୨୫"},
    // ],
    "2023-08-26": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଝୁଲଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୨୬",
      },
    ],
    "2023-08-27": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ପୁତ୍ରଦା ଏକାଦଶୀ ଉପବାସ", "ରବିନାରାୟଣ ବ୍ରତ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୨୭",
        "holydy":DateTime(2023, 08, 27),
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-08-28": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ବିଷ୍ଣୁ ପବିତ୍ରାରୋପଣ", "ଆଖେଟକ ପର୍ବ", "ଶରଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୨୮"
      },
    ],
    "2023-08-29": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବ ପବିତ୍ରାରୋପଣ", "ଶିବ ଚତୁର୍ଦ୍ଦଶୀ ଉପବାସ", "ବେଢ଼ା"],
        "ତାରିଖ": "୨୯"
      },
    ],
    "2023-08-30": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଗହ୍ମା ପର୍ବ",
          "ବଳଦେବଙ୍କ ଜନ୍ମ",
          "ରକ୍ଷାବନ୍ଧନ",
          "ଚନ୍ଦ୍ରପୂଜା"
        ],
        "ତାରିଖ": "୩୦",
        "holydy":DateTime(2023, 08, 30),
      },
    ],
    "2023-08-31": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଗହ୍ମା ପୂର୍ଣ୍ଣିମା"],
        "ତାରିଖ": "୩୧",
        "holyimg":["purnima.jpg"]
      },
    ],
  };
  Sep = {
    "2023-09-01": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଶେଷ"],
        "ତାରିଖ": "୧",
      },
    ],
    "2023-09-02": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଅଙ୍ଗପ୍ଲେଟ ତୃତୀୟା"],
        "ତାରିଖ": "୨"
      },
    ],
    "2023-09-03": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଖୁଦୁରୁକୁଣୀ ଓଷା"],
        "ତାରିଖ": "୩",
        "img":["khudurkuni.jpeg"],
        "holydy":DateTime(2023, 09, 03)
      },
    ],
    "2023-09-04": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ରେଖା", "ରକ୍ଷା ପଞ୍ଚମୀ"],
        "ତାରିଖ": "୪"
      },
    ],
    "2023-09-05": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଗୁରୁ ଦିବସ", "ସର୍ବପଲ୍ଲୀ ରାଧାକ୍ରିଷ୍ଣଙ୍କ ଜୟନ୍ତୀ"],
        "ତାରିଖ": "୫",
        "holydy":DateTime(2023, 09, 05),
        "img":["gurudivas.jpeg"]
      },
    ],
    "2023-09-06": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରୀକୃଷ୍ଣ ଜନ୍ମାଷ୍ଟମୀ", "ବୁଧୁବାମନ ଓଷା"],
        "ତାରିଖ": "୬",
        "holydy":DateTime(2023, 09, 06),
        "img":["janmastami.jpeg"]
      },
    ],
    "2023-09-07": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ନନ୍ଦୋତ୍ସବ କାଳୀୟଦଳନ ଏକାଦଶୀ"],
        "ତାରିଖ": "୭"
      },
    ],
    "2023-09-08": [
      {
        "ସୁଭଦିନ": ["ବିଦ୍ୟାରମ୍ଭ"],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୮"
      },
    ],
    // "2023-09-09": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //    // "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୯",
    //     "holydy":DateTime(2023, 09, 09)
    //   },
    // ],
    "2023-09-10": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୧୦",
        "holydy":DateTime(2023, 09, 10),
        "holyimg":["ekadasi.jpg"]
      }
    ],
    "2023-09-11": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ", "ବିଦ୍ୟାରମ୍ଭ"],
        //  "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୧୧"
      },
    ],
    "2023-09-12": [
      {
        //"ସୁଭଦିନ": [],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୧୨"
      },
    ],
    "2023-09-13": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ", "ବେଢ଼ା ପରିକ୍ରମା"],
        "ତାରିଖ": "୧୩"
      },
    ],
    "2023-09-14": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଅମାବାସ୍ୟା",
          "ଚନ୍ଦ୍ରକ୍ଷୟ",
          "ଶ୍ରୀମନ୍ଦିରେ ଗୃହିଣା ସପ୍ତପୁରୀ ରୋଗ***"
        ],
        "ତାରିଖ": "୧୪",
        "holyimg":["amabashya-.jpg"]
      },
    ],
    "2023-09-15": [
      {
        //"ସୁଭଦିନ": [],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୧୫"
      },
    ],
    "2023-09-16": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ତାରିଖ": "୧୬",
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରଦର୍ଶନ", "ପୂଜା"]
      }
    ],
    "2023-09-17": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["କନ୍ୟା ସଂକ୍ରାନ୍ତି", "ବିଶ୍ବକର୍ମା ପୂଜା", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୭",
        "img":["kartika-purnima.jpeg"],
        "holydy":DateTime(2023, 09, 17)
      },
    ],
    "2023-09-18": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ବାଲି ତୃତୀୟା"],
        "ତାରିଖ": "୧୮"
      },
    ],
    "2023-09-19": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରୀ ଗଣେଶ ଚତୁର୍ଥୀ ବ୍ରତ"],
        "ତାରିଖ": "୧୯",
        "holydy":DateTime(2023, 09, 19),
        "img":["ganesh-puja.jpeg"]
      },
    ],
    "2023-09-20": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ନୂଆଖାଇ", "ଋଷି ପଞ୍ଚମୀ"],
        "ତାରିଖ": "୨୦",
        "holydy":DateTime(2023, 09, 20),
        "img":["nuakhai.jpeg"]
      },
    ],
    "2023-09-21": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଷଷ୍ଠୀ ଓଷା",
          "ସୋମନାଥ ବ୍ରତାରମ୍ଭ",
          "ଲଳିତା ସପ୍ତମୀ",
          "କୁକ୍କୁଟୀ ବ୍ରତ"
        ],
        "ତାରିଖ": "୨୧"
      },
    ],
    "2023-09-22": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରୀ,ରାଧାଷ୍ଟମୀ", "ଶ୍ରୀଦୁର୍ଗା ଶୟନୋତ୍ସବ"],
        "ତାରିଖ": "୨୨"
      }
    ],
    "2023-09-23": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଦୁର୍ବାଷ୍ଟମୀ"],
        "ତାରିଖ": "୨୩",
      },
    ],
    "2023-09-24": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ତାଳନବମୀ", "ଅନୁକୁଳ ଚନ୍ଦ୍ରଙ୍କ ଜୟନ୍ତୀ", "ଶରଣ ଆରମ୍ଭ"],
        "ତାରିଖ": "୨୪",
        "holydy":DateTime(2023, 09, 24)
      },
    ],
    "2023-09-25": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ପାର୍ଶ୍ଵପରିବର୍ତ୍ତନ ( ବଡ଼ ) ଏକାଦଶୀ", "ଡ . ନି ."],
        "ତାରିଖ": "୨୫",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-09-26": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ସୁନିଆଁ", "ଅ୬୬୮ ୧୪୩୧ ସାଇ ପ୍ରବେଶ", "ବାମନ ଜନ୍ମ"],
        "ତାରିଖ": "୨୬",
        "img":["baban.jpeg"]
      },
    ],
    "2023-09-27": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଅନ୍ନ ପ୍ରାସନ", "ବିଦ୍ୟାରମ୍ଭ"],
        //"ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୨୭"
      },
    ],
    "2023-09-28": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ମହାପୁରୁଷ ମହମ୍ମଦଙ୍କ ଜନ୍ମ ଦିବସ",
          "ଅଘୋର ଚତୁର୍ଦ୍ଦଶୀ",
          "ଅନନ୍ତ ବ୍ରତ",
          "ଚନ୍ଦ୍ରପୂଜା",
          "ଶରଣ ଶେଷ"
        ],
        "ତାରିଖ": "୨୮"
      },
    ],
    "2023-09-29": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଇନ୍ଦ୍ରୋତ୍ସବ ଦୂଷିମା", "ଭାଗବତ ଜନ୍ମ", "ଅପରପକ୍ଷାରମ୍ଭ"],
        "ତାରିଖ": "୨୯",
        "holydy":DateTime(2023, 09, 29),
        "holyimg":["purnima.jpg"]
      },
    ],
    "2023-09-30": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୩୦"
      },
    ],
    // "2023-09-31": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //    // "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୩୧"
    //   },
    // ],
  };
  Oct = {
    "2023-10-01": [
      {
        "ସୁଭଦିନ": [
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
        ],
        "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୧",
        "holydy":DateTime(2023, 10, 01)
      },
    ],
    "2023-10-02": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଗାନ୍ଧୀ ଜୟନ୍ତୀ", "ଶାସ୍ତ୍ରୀଙ୍କ ଜୟନ୍ତୀ"],
        "ତାରିଖ": "୨",
        "holydy":DateTime(2023, 10, 02),
        "img":["gitajayanti.jpeg"]
      },
    ],
    "2023-10-03": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଅଶ୍ଵ ପଞ୍ଚମୀ"],
        "ତାରିଖ": "୩"
      },
    ],
    "2023-10-04": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଗଳଷଷ୍ଠୀ"],
        "ତାରିଖ": "୪"
      },
    ],
    "2023-10-05": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୫"
      },
    ],
    "2023-10-06": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଦେବୃତ୍ପନ",
          "ସହସ୍ର କୁମ୍ଭାଭିଷେକ",
          "ମୂଳାଷ୍ଟମୀ",
          "ଷୋଡ଼ଶ ଦିନାତ୍ମକ ପୂଜା",
          "ଦ୍ଵିତୀବାହନ ଓଷା **"
        ],
        "ତାରିଖ": "୬"
      },
    ],
    // "2023-10-07": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୭"
    //   },
    // ],
    "2023-10-08": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        //  "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୮",
        "holydy":DateTime(2023, 10, 08)
      },
    ],
    // "2023-10-09": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୯"
    //   },
    // ],
    "2023-10-10": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଇନ୍ଦିରା ଏକାଦଶୀ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୦",
        "holyimg":["ekadasi.jpg"]
      }
    ],
    // "2023-10-11": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୧୧"
    //   },
    // ],
    // "2023-10-12": [
    //   {
    //     "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୧୨"
    //   },
    // ],
    "2023-10-13": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବଚତୁର୍ଦ୍ଦଶୀ", "ବେଢ଼ା ପରିକ୍ରମା"],
        "ତାରିଖ": "୧୩"
      },
    ],
    "2023-10-14": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ମହାଳୟା ଅମାବାସ୍ୟା",
          "ଚନ୍ଦ୍ରକ୍ଷୟ",
          "ଫୁଲେରୀ ଓଷା",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୧୪",
        "img":["gurubar.jpeg"],
        "holyimg":["amabashya-.jpg"]
      },
    ],
    "2023-10-15": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଅନ୍ନ ପ୍ରାସନ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଶ୍ରୀଦୁର୍ଗାଦେବ ନବଦିନାତ୍ମକ ପୂଜାରମ୍ଭ",
          "ବିରଳାଦେବୀଙ୍କ ରଥଯାତ୍ରା"
        ],
        "ତାରିଖ": "୧୫",
        "img":["birajadevi.jpeg"],
        "holydy":DateTime(2023, 10, 15)
      },
    ],
    "2023-10-16": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଅନ୍ନ ପ୍ରାସନ", "ନାମକରଣ"],
        //"Mirrage": [],
        "ତାରିଖ": "୧୬",
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରଦର୍ଶନ", "ପୂଜା"]
      }
    ],
    // "2023-10-17": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୧୭"
    //   },
    // ],
    "2023-10-18": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ତୁଳା(ଗର୍ଭଣା) ସଂକ୍ରାନ୍ତି", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୮"
      },
    ],
    "2023-10-19": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ନତଃ ପଞ୍ଚମୀ"],
        "ତାରିଖ": "୧୯"
      },
    ],
    "2023-10-20": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ତପଃ ଷଷ୍ଠୀ",
          "ବିଧ୍ଵବାସ",
          "ଶ୍ରୀଦୁର୍ଗାଦେଶ୍ୟ ତ୍ରିଦିନାତ୍ମକ ସପ୍ତମୀ ପୂଜାରମଃ"
        ],
        "ତାରିଖ": "୨୦"
      },
    ],
    "2023-10-21": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ପୀଠେ ମହାଷ୍ଟମୀ",
          "ଦୁର୍ଗାବ୍ରତ",
          "ମୃଣ୍ମୟୀ ଦେବୀଙ୍କ ସପ୍ତମୀ ପୂଜା"
        ],
        "ତାରିଖ": "୨୧",
        "holydy":DateTime(2023, 10, 21)
      },
    ],
    "2023-10-22": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ପୀଠେ ମହାନବମୀ",
          "ମୃଣ୍ମୟୀ ଦେବୀଙ୍କ ମହାଷ୍ଟମୀ ପୂଜା",
          "ଶରଣ ଆରମ୍ଭ"
        ],
        "ତାରିଖ": "୨୨",
        "img":["dasahara.jpeg"],
        "holydy":DateTime(2023, 10, 22)
      },
    ],
    "2023-10-23": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ମୃଣ୍ମୟୀ ଦେବୀଙ୍କ ମହାନବମୀ ପୂଜା", "ପୀଠେ ବିଶ୍ରାମ"],
        "ତାରିଖ": "୨୩",
        "holydy":DateTime(2023, 10, 23)
      },
    ],
    "2023-10-24": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": [" ବିଜୟା ଦଶମୀ", "ଦଶହରା"],
        "ତାରିଖ": "୨୪",
        "holydy":DateTime(2023, 10, 24),
        "img":["dasahara.jpeg"]
      },
    ],
    "2023-10-25": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଭଷାଣୀଯାତ୍ରା",
          "ପାପାଙ୍କୁଶା ଏକାଦଶୀ",
          "ଗୋଷାଣୀ ଯାତ୍ରା",
          "ହ.ନି."
        ],
        "ତାରିଖ": "୨୫",
        "img":["vasani.jpeg"],
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-10-26": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଶେଷ"],
        "ତାରିଖ": "୨୬"
      },
    ],
    "2023-10-27": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଗ୍ୟାର୍ଚ୍ଚ ସରିଫ୍"],
        "ତାରିଖ": "୨୭"
      },
    ],
    "2023-10-28": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["କୁମାର ପୂର୍ଣିମା", "ଗଜଲକ୍ଷ୍ମୀ ପୂଜା", "ଚନ୍ଦ୍ରପୂଜା"],
        "ତାରିଖ": "୨୮",
        "img":["kumara-purnima.jpeg"],
        "holyimg":["purnima.jpg"]
      },
    ],
    "2023-10-29": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "କାର୍ତ୍ତିକ ବ୍ରତାରମ୍ଭ",
          "ପଣ୍ଡିତ ପରୀକ୍ଷିତ",
          "ଜ୍ୟୋତିର୍ବିଦ ବିଷ୍ଣୁ ପ୍ରସାଦଙ୍କ ଶ୍ରାଦ୍ଧ"
        ],
        "ତାରିଖ": "୨୯",
        "holydy":DateTime(2023, 10, 29)
      },
    ],
    // "2023-10-30": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୩୦"
    //   },
    // ],
    "2023-10-31": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        //  "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୩୧"
      },
    ],
  };
  Nov = {
    // "2023-11-01": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୧",
    //   },
    // ],
    // "2023-11-02": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୨"
    //   },
    // ],
    "2023-11-03": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୩"
      },
    ],
    "2023-11-04": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        //  "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୪"
      },
    ],
    "2023-11-05": [
      {
        //"ସୁଭଦିନ": [],
        //  "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୫",
        "holydy":DateTime(2023, 11, 05)
      },
    ],
    // "2023-11-06": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୬"
    //   },
    // ],
    // "2023-11-07": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୭"
    //   },
    // ],
    // "2023-11-08": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //    // "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୮"
    //   },
    // ],
    "2023-11-09": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ରମା ଏକାଦଶୀ", "ଗୋବସ ଦ୍ଵାଦଶୀ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୯",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-11-10": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": ["୧୦"],
        "ତାରିଖ": "୧୦",
      }
    ],
    "2023-11-11": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ନରକ ଚତୁର୍ଦ୍ଦଶୀ", "ଶିବଚତୁର୍ଦ୍ଦଶୀ", "ଧନୁରୀ ଜୟନ୍ତୀ"],
        "ତାରିଖ": "୧୧",
      },
    ],
    "2023-11-12": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଶ୍ୟାମାକାଳୀ ପୂଜା",
          "ଦୀପାବଳୀ",
          "ଚନ୍ଦ୍ରକ୍ଷୟ",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୧୨",
        "img":["dipabali.jpeg"],
        "holydy":DateTime(2023, 11, 12)
      },
    ],
    "2023-11-13": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଅମାବାସ୍ୟା", "ପୟାଶ୍ରାଦ୍ଧ", "ସୋମମହତୀ ସ୍ନାନ"],
        "ତାରିଖ": "୧୩",
        "holyimg":["amabashya-.jpg"]
      },
    ],
    "2023-11-14": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଗୋବର୍ଦ୍ଧନ ପୂଳା",
          "ଅନ୍ନକୂଟ",
          "ଶିଶୁ ଦିବସ",
          "ନେହେରୁଙ୍କ ଜୟନ୍ତୀ 3 ଚନ୍ଦ୍ରଦର୍ଶନ"
        ],
        "ତାରିଖ": "୧୪",
        "holydy":DateTime(2023, 11, 14),
        "img":[]
      },
    ],
    "2023-11-15": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଯମ", "ଭାତୃ ଦ୍ବିତୀୟ"],
        "ତାରିଖ": "୧୫"
      },
    ],
    // "2023-11-16": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ତାରିଖ": "୧୬",
    //     "ପର୍ବପର୍ବାଣୀ": [""]
    //   }
    // ],
    "2023-11-17": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ବିଛା ସଂକ୍ରାନ୍ତି",
          "କାର୍ତ୍ତିକେୟ ପୂଜା",
          "ନାଗ ଚତୁର୍ଥୀ",
          "ହ.ମି.",
          "୧୮ ଶରଣ ଆରମ୍ଭ"
        ],
        "ତାରିଖ": "୧୭",
        "img":["kartikeya.jpeg"]
      },
    ],
    "2023-11-18": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୧୮"
      },
    ],
    "2023-11-19": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଷୋଳଶାସନ ଅମୃତମଣୋହି ଭୋଗ"],
        "ତାରିଖ": "୧୯",
        "holydy":DateTime(2023, 11, 19)
      },
    ],
    "2023-11-20": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ", "ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଗୋଷ୍ମାଷ୍ଟମୀ"],
        "ତାରିଖ": "୨୦"
      },
    ],
    "2023-11-21": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଅଁଳା ନବମୀ",
          "ଶ୍ରୀରାଧାଙ୍କ ପାଦଦର୍ଶନ",
          "ଜଗଦ୍ଧାତ୍ରୀ ପୂଜା"
        ],
        "ତାରିଖ": "୨୧",
        "img":["aamla-nabami.jpeg"]
      },
    ],
    "2023-11-22": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶ୍ରୀ,କୃଷ୍ଣଙ୍କ ଶରଦ୍ରାସାଧିବାସ", "ଶରଣ ଶେଷ"],
        "ତାରିଖ": "୨୨"
      }
    ],
    "2023-11-23": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ", "ବ୍ୟବସାୟ ଆରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": [
          "ଦେବୋତ୍ଥାପନ ( ବଡ଼ ) ଏକାଦଶୀ",
          "ଲକ୍ଷ୍ମୀ ନାରାୟଣ ବ୍ରତ",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୨୩",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-11-24": [
      {
        "ସୁଭଦିନ": [
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଗରୁଡ଼ ଦ୍ବାଦଶୀ", "ତୁଳସୀ ବିବାହ"],
        "ତାରିଖ": "୨୪"
      },
    ],
    "2023-11-25": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଶିବରତ୍ଥାପନ", "ବଡ଼ ଓଷା ବୈକୁଣ୍ଠ ଚତୁର୍ଦ୍ଦଶୀ"],
        "ତାରିଖ": "୨୫",
        "img":["badaosa.jpeg"]
      },
    ],
    "2023-11-26": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରପୂଜା", "କେଦାର ବ୍ରତ"],
        "ତାରିଖ": "୨୬",
        "holydy":DateTime(2023, 11, 26)
      },
    ],
    "2023-11-27": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ରାସ ପୂର୍୨୭ଣ୍ଣିମା",
          "ବାଲିଯାତ୍ରା",
          "କାର୍ତ୍ତିକେଶ୍ବର ପୂଜା"
        ],
        "ତାରିଖ": "୨୭",
        "holydy":DateTime(2023, 11, 27),
        "img":["balijatra.jpeg"],
        "holyimg":["purnima.jpg"]
      },
    ],
    "2023-11-28": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଛାଡ଼ଖାଇ"],
        "ତାରିଖ": "୨୮",
        "img":["chadakhai.jpeg"]
      },
    ],
    "2023-11-29": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        //  "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୨୯"
      },
    ],
    "2023-11-30": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ମାର୍ଗଶୀର ଗୁରୁବାର"],
        "ତାରିଖ": "୩୦"
      },
    ],
    // "2023-11-31": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୩୧"
    //   },
    // ],
  };
  Dec = {
    // "2023-12-01": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୧",
    //   },
    // ],
    "2023-12-02": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ସୀତା ବିବାହ", "ଶ୍ରୀକ୍ଷେତ୍ର ପରିକ୍ରମା"],
        "ତାରିଖ": "୨",
        "img":["sitabibah.jpeg"]
      },
    ],
    "2023-12-03": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        //  "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୩",
        "holydy":DateTime(2023, 12, 03)
      },
    ],
    "2023-12-04": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୪",
      },
    ],
    "2023-12-05": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ପ୍ରଥମାଷ୍ଟମୀ"],
        "ତାରିଖ": "୫",
      },
    ],
    "2023-12-06": [
      {
        "ସୁଭଦିନ": ["ବିବାହ"],
        "ପର୍ବପର୍ବାଣୀ": ["କାଞ୍ଜିଅଁଳା ନବମୀ"],
        "ତାରିଖ": "୬"
      },
    ],
    "2023-12-07": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ନାମକରଣ", "ବିଦ୍ୟାରମ୍ଭ"],
        "ପର୍ବପର୍ବାଣୀ": ["ମାଣବସା ଗୁରୁବାର ଓଷା"],
        "ତାରିଖ": "୭",
        "img":["gurubar.jpeg"]
      },
    ],
    "2023-12-08": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ନାମକରଣ"],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୮"
      },
    ],
    "2023-12-09": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଉତ୍ପନ୍ନା ଏକାଦଶୀ", "ହ.ନି."],
        "ତାରିଖ": "୯",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-12-10": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        //  "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୧୦",
        "holydy":DateTime(2023, 12, 10)
      }
    ],
    "2023-12-11": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଦେବଦୀପାବଲ୍ୟୁତ୍ସବ ଆରମ୍ଭ", "ଶିବଚତୁର୍ଦ୍ଦଶୀ", "ବେଢ଼ା"],
        "ତାରିଖ": "୧୧"
      },
    ],
    "2023-12-12": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ମହୋଦଧୂ ଅମାବାସ୍ୟା", "ଚନ୍ଦ୍ରକ୍ଷୟ", "ହଳ ନିଷେଧ"],
        "ତାରିଖ": "୧୨",
        "holyimg":["amabashya-.jpg"]
      },
    ],
    "2023-12-13": [
      {
        "ସୁଭଦିନ": ["ବିବାହ", "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଦେବଦୀପାବଲ୍ୟୁତ୍ସବ ସମାପ୍ତି"],
        "ତାରିଖ": "୧୩"
      },
    ],
    "2023-12-14": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରଦର୍ଶନ", "ପୂଜା"],
        "ତାରିଖ": "୧୪"
      },
    ],
    "2023-12-15": [
      {
        "ସୁଭଦିନ": [
          "ବିବାହ",
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ"
        ],
        "ପର୍ବପର୍ବାଣୀ": ["ଚନ୍ଦ୍ରଦର୍ଶନ", "ପୂଜା"],
        "ତାରିଖ": "୧୫"
      },
    ],
    "2023-12-16": [
      {
        //"ସୁଭଦିନ": [],
        "ତାରିଖ": "୧୬",
        "ପର୍ବପର୍ବାଣୀ": ["ଧନୁ ସଂକ୍ରାନ୍ତି", "ପହିଲି ଭୋଗ", "ହଳ ନିଷେଧ"]
      }
    ],
    "2023-12-17": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ", "ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["କୁରାଳ ପଞ୍ଚମୀ"],
        "ତାରିଖ": "୧୭",
        "img":["kuralpanchami.jpeg"],
        "holydy":DateTime(2023, 12, 17)
      },
    ],
    "2023-12-18": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଓଜଣ ଷଷ୍ଠୀ", "ପ୍ରାବରଣ ଷଷ୍ଠୀ ***"],
        "ତାରିଖ": "୧୮",
        "img":["odhanisasti.jpeg"]
      },
    ],
    "2023-12-19": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": ["ଶରଣ ଶେଷ"],
        "ତାରିଖ": "୧୯"
      },
    ],
    // "2023-12-20": [
    //   {
    //     //"ସୁଭଦିନ": [],
    //    // "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୨୦"
    //   },
    // ],
    "2023-12-21": [
      {
        "ସୁଭଦିନ": [
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ବ୍ୟବସାୟ ଆରମ୍ଭ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୨୧"
      },
    ],
    "2023-12-22": [
      {
        "ସୁଭଦିନ": [
          "ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ",
          "ନାମକରଣ",
          "ଅନ୍ନ ପ୍ରାସନ",
          "ବିଦ୍ୟାରମ୍ଭ"
        ],
        //  "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୨୨"
      }
    ],
    "2023-12-23": [
      {
        //"ସୁଭଦିନ": [],
        "ପର୍ବପର୍ବାଣୀ": [
          "ବ୍ୟଞ୍ଜନ ଦ୍ଵାଦଶୀ",
          "ମୋକ୍ଷଦା ଏକାଦଶୀ ଉପବାସ",
          "ହଳ ନିଷେଧ"
        ],
        "ତାରିଖ": "୨୩",
        "holyimg":["ekadasi.jpg"]
      },
    ],
    "2023-12-24": [
      {
        "ସୁଭଦିନ": ["ଗୃହାରମ୍ଭ ଓ ପ୍ରବେଶ", "ବ୍ୟବସାୟ ଆରମ୍ଭ", "ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଅନଙ୍ଗ ତ୍ରୟୋଦଶୀ", "ଗୀତା ଜୟନ୍ତୀ"],
        "ତାରିଖ": "୨୪",
        "img":["gitajayanti.jpeg"],
        "holydy":DateTime(2023, 12, 24)
      },
    ],
    "2023-12-25": [
      {
        "ସୁଭଦିନ": ["ଅନ୍ନ ପ୍ରାସନ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଯୀଶୁଖ୍ରୀଷ୍ଟଙ୍କ ଜନ୍ମ ( ବଡ଼ଦିନ )", "ପାଷାଣ ଚତୁର୍ଦ୍ଦଶୀ"],
        "ତାରିଖ": "୨୫",
        "holydy":DateTime(2023, 12, 25),
        //"iumg":[]
      },
    ],
    "2023-12-26": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ପୂର୍ଣିମା", "ପଶୁ ଓଷା", "ଚନ୍ଦ୍ରପୂଜା"],
        "ତାରିଖ": "୨୬",
        "holyimg":["purnima.jpg"]
      },
    ],
    // "2023-12-27": [
    //   {
    //     "ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୨୭"
    //   },
    // ],
    "2023-12-28": [
      {
        "ସୁଭଦିନ": ["ନାମକରଣ"],
        "ପର୍ବପର୍ବାଣୀ": ["ଦାଣ୍ଡ ପହଁରା", "ବାଟ ଓଷା"],
        "ତାରିଖ": "୨୮"
      },
    ],
    "2023-12-29": [
      {
        "ସୁଭଦିନ": ["ବ୍ୟବସାୟ ଆରମ୍ଭ", "ନାମକରଣ"],
        //"ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୨୯"
      },
    ],
    // "2023-12-30": [
    //   {
    //     "ସୁଭଦିନ": [],
    //     "ପର୍ବପର୍ବାଣୀ": [""],
    //     "ତାରିଖ": "୩୦"
    //   },
    // ],
    "2023-12-31": [
      {
        // "ସୁଭଦିନ": [],
        // "ପର୍ବପର୍ବାଣୀ": [""],
        "ତାରିଖ": "୩୧",
        "holydy":DateTime(2023, 12, 31)
      },
    ],
  };
  mySelectedEvents = {};
}